# 1) პროგრამამ უნდა შეგაყვანინოთ სახელი, გვარი და ასაკი. ეკრანზე უნდა გამოვიდეს, გამარჯობა, „თქვენს მიერ შეყვანილი სახელი, გვარი“, თქვენ ხართ „თქვენი წლოვანება“ წლის.
name = input("შეიყვანეთ თქვენი სახელი: ") 
lastname = input("შეიყვანეთ თქვენი გვარი: ")
age = input("შეიყვანეთ თქვენი ასაკი: ")

print("გამარჯობა, ", name, "შენი გვარია: ", lastname, ", და შენ ხარ ", age, "წლის")
# --------------------------------- end of first classwork


# 2) პროგრამამ უნდა შეგაყვანინოთ სახელი და დაბადების წელი. ეკრანზე უნდა გამოვიდეს, გამარჯობა, „თქვენს მიერ შეყვანილი სახელი“, თქვენ ხართ „თქვენი წლოვანება“ წლის. 
name = input("რა გქვია?")
year = input("რომელ წელს დაიბადე?")

age = 2025 - int(year)

print(name, "შენი ასაკია: ", age)
# -------------------------------- end of second classwork


# 3) Დაწერეთ პროგრამა რომელიც მომხმარებელს მისცემს საშუალებას შეიყვანოს პროგრამაში სამკუთხედის გვერდები. Პროგრამამ უნდა დაბეჭდოს ეკრაზე სამკუთხედის ფართობი და პერიმეტრი. 
import math

a = input("შეიყვანე სამკუთხედის პირველი გვერდი: ")
b = input("შეიყვანე სამკუთხედის მეორე გვერდი: ")
c = input("შეიყვანე სამკუთხედის მესამე გვერდი: ")

p = int(a) + int(b) + int(c)
semiP = p / 2
s = math.sqrt( semiP * (semiP - int(a)) * (semiP - int(b)) * (semiP - int(c)) )

print("პერიმეტრი არის: ", p, "ფართობი არის: ", s)
# ------------------------------- end of third classwork


# 4) დაწერეთ პროგრამა, რომელიც მომხმარებლის მიერ შეყვანილ ტემპერატურას ცელსიუსში გადაიყვანს ფარენჰეიტში
celsius = input("შეიყვანეთ ტემპერატურა ცელსიუსებში: ")
f = (int(celsius) * 9 / 5) + 32

print(celsius, " ფარენგეითებში არის: ", f)
# ------------------------------ end of assignment
 